#  методы строк
# dir() -> функция вытаскивает методы типов данных
# print(dir(str))
# '<soedinitel>'.join(mass which need soed) соединяет массив из строк по соединителю в одну строку
# ***********************************************************************************************************

# ls = ['milk', 'water', 'bread', 'apple']

# # joined = '+'.join(ls)
# print(joine
# ***********************************************************************************************************

# split(рфзделитель) -> дробит строку по разделителю и возвращает тип данных в list

# text = 'hi. my. name. is. blablabla'
# splited = text.split('. ')
# print(splited)
# joined = ', '.join(splited)
# print(joined)
# ***********************************************************************************************************

# replace(<old>, <new>, [count]) change old in string to new  если укажите count,  то заменяет  count раз

# text = 'lol lol lol lol lol'
# text = text.replace('l', 'bib')
# print(text)
# ***********************************************************************************************************

# strip ()-> убирает пробельные символы
# rstrip()->справа 
# lstrip()->слева

# name = input('enter name ')
# print(name.strip())
# print(name)
# ***********************************************************************************************************

# count('simbol') -> считает колличество вхождение <simbol>  в стрроке

# text = 'hello world! i\'m from earth'
# result = text.count('l')
# print(result)
# ***********************************************************************************************************

# index(<value>, [start], [end]) ->  выводит индекс значения value  в нашей строке

# text = 'hello tim! this is me'
# result = text.index('!')
# print(result)
#print(tet.find(''))
# **********************************************************************************************************