#  GIT - распределенная система контроля версий.
#  это сисстема для отслеживания и ведения истории изменения файломб в вашем проекте

# Репозитторий - это хранилище вашего кода и иистории его измнений

# GitHub -  веб сайт для размещения git - репозиториев и совместной разработки проектов

#  GIT comands

# 1) git init - оно создает новый гит репозиторий локальный на вашем пк

# 2) git commit - как только мы достигаем определенного момента в разрабоке то тогда мы сохраняем и комментируем изменений (фиксация изменений репозиторий)
# git commit -m '<comment>'

# 3)git add -  когда мы создаем или изменяем файлы, то при помощи команды мы загружаем все изменения в локальный репозиторий
# git add <file name which we change>
# git add .


# 4) git remote add - это команда для того чтобы связать ваш проект с удаленным репозиторием (репозит в гитхабе)
# git remote add <название подкл> <ссылка на репозит>
# git remote add origin <url>

# 5) git push -после комита изиенений при помощи этой команды отправляем наши изменения на удаленный репозиторий
# git push <название ветки>



####################################################################################


# 6) git branch - ветки очень важны в GIT
#  при помощи веток несколько программистов могут работать паралельно наодном и том  же проекте. При помощи команды git branch  мы мжем создавать, просматривать или удолять ветки
# создавание git branch <название ветки>
# просматривание ветки  git branch or git branch --list
# удаление ветки: git branch - d <название ветки>

# 7) git checkout - команда используеся для работы в команде, она помогает переключаться по веткам
# git checkout <название ветки>
# 
строчка ветки тимы
# 
# 
# 
# 
# 
# 