#  GIT - распределенная система контроля версий.
#  это сисстема для отслеживания и ведения истории изменения файломб в вашем проекте

# Репозитторий - это хранилище вашего кода и иистории его измнений

# GitHub -  веб сайт для размещения git - репозиториев и совместной разработки проектов

#  GIT comands

# 1) git init - оно создает новый гит репозиторий локальный на вашем пк

# 2) git commit - как только мы достигаем определенного момента в разрабоке то тогда мы сохраняем и комментируем изменений (фиксация изменений репозиторий)
# git commit -m '<comment>'

# 3)git add -  когда мы создаем или изменяем файлы, то при помощи команды мы загружаем все изменения в локальный репозиторий
# git add <file name which we change>
# git add .
# 