CTRL + ALT + T -> open terminal  
~ -> Символ домашней директории (папки)
/ -> символ корневой директории (папки)
.. -> предыдущая директория
. -> текущая директория

1) ls(list) -> выводит список директории(папок)и файлов в текущей
2) cd(change directory) ->  меняет текущую деректорию на указанную (cd<название директрии>)
3) touch -> cоздает указанный файл(touch<name_of_file>)
4) pwd(present working directory) -> выводит путь  до текущей директории(папка)
5) mkdir(make directory) ->  создает указанную директорию(file) 
6) rmdir(remove directoey) ->  удаление указанную директорию (файл)
7) rm -rf (remove - remove fors) -> принудительное удаление
8)rm <name file> -> remove file
9) ls -a -> выводит список как скрытых так и обычных директори и файлов
10) ls -la -> выводит все списки директорий и файлов
11) cd + . + <name file or folder> -> создание скрытого 
12) nano + <path_to_ file> -> показать все файлы (скрытые тоже), открывает граф. интерфейс для редоктирования. если нет указанного файла, то создается файл с таким имеем 
13) cat + <path to_file> -> показать файл (скрытые) но в терминале
14) mv -> rename file
15) gnome-system-monitor -> запуск task manager
16) ping <name_of_web> --> узнаем пинг сайта
17) df <name_of_directory>  --> узнаем сколко память есть и занято
